logs/async/8/ab_results-async-10.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /async
Document Length:        144 bytes

Concurrency Level:      10
Time taken for tests:   2.109 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      388000 bytes
HTML transferred:       144000 bytes
Requests per second:    474.05 [#/sec] (mean)
Time per request:       21.095 [ms] (mean)
Time per request:       2.109 [ms] (mean, across all concurrent requests)
Transfer rate:          179.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     4   21  26.8     11     158
Waiting:        4   16  19.3     10     131
Total:          5   21  26.8     11     158

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     14
  80%     17
  90%     55
  95%     78
  98%    119
  99%    141
 100%    158 (longest request)