logs/async/8/ab_results-async-50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /async
Document Length:        144 bytes

Concurrency Level:      50
Time taken for tests:   1.110 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      388000 bytes
HTML transferred:       144000 bytes
Requests per second:    900.77 [#/sec] (mean)
Time per request:       55.508 [ms] (mean)
Time per request:       1.110 [ms] (mean, across all concurrent requests)
Transfer rate:          341.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      1       3
Processing:     6   54  66.7     20     343
Waiting:        5   38  43.8     18     231
Total:          6   55  66.6     21     343

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     26
  75%     47
  80%     76
  90%    190
  95%    200
  98%    203
  99%    207
 100%    343 (longest request)